[
   {
      "id": 1,
      "Title": "Microsoft’s Satya Nadella is choosing chatbots over podcasts",
      "author": "Anthony Ha",
      "Publish Date": "15 hours ago",
      "Summary": "While Microsoft CEO Satya Nadella says he likes podcasts, he might not actually be listening to them anymore.",
      "Full Content": "Posted:/nWhile Microsoft CEO Satya Nadella says he likes podcasts, he might not actually be listening to them anymore./nThat tidbit comes towards the end of a longer Bloomberg profile of Nadella, with a focus on Microsoft’s AI strategy and its complicated relationship with OpenAI. To illustrate how much he uses the company’s Copilot AI assistant in his daily life, Nadella said that instead of listening to podcasts, he now uploads the transcripts to Copilot, then talks to Copilot about the content during his drive to the office./nIn addition, Nadella — who jokingly described his job as “email typist” — said he relies on at least 10 custom agents developed in Copilot Studio to summarize emails and messages, prepare for meetings, and perform other tasks around the office./nAI already seems to be transforming Microsoft in more substantial ways, with programers reportedly the hardest hit in the company’s recent layoffs, shortly after Nadella declared that 30% of the company’s code was written by AI./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/microsofts-satya-nadella-is-choosing-chatbots-over-podcasts/"
   },
   {
      "id": 2,
      "Title": "MIT disavows doctoral student paper on AI’s productivity benefits",
      "author": "Anthony Ha",
      "Publish Date": "16 hours ago",
      "Summary": "MIT says that due to concerns about the “integrity” of a high-profile paper about the effects of artificial intelligence on research and innovation, the paper should be “withdrawn from public discourse.”",
      "Full Content": "MIT says that due to concerns about the “integrity” of a high-profile paper about the effects of artificial intelligence on research and innovation, the paper should be “withdrawn from public discourse.”/nThe paper in question, “Artificial Intelligence, Scientific Discovery, and Product Innovation,” was written by a doctoral student in the university’s economics program. It claimed to show that the introduction of an AI tool into a large-but-unidentified materials science lab led to the discovery of more materials and more patent filings, but at the cost of reducing researchers’ satisfaction with their work./nMIT economists Daron Acemoglu (who recently won the Nobel Prize) and David Autor both praised the paper last year, with Autor telling the Wall Street Journal he was “floored.” In a statement included in MIT’s announcement on Friday, Acemoglu and Autor described the paper as “already known and discussed extensively in the literature on AI and science, even though it has not been published in any refereed journal.”/nHowever, the two economists said they now have “no confidence in the provenance, reliability or validity of the data and in the veracity of the research.”/nAccording to the WSJ, a computer scientist with experience in materials science approached Acemoglu and Autor with concerns in January. They brought those concerns to MIT, leading to an internal review./nMIT says that due to student privacy laws, it cannot disclose the results of that review, but the paper’s author is “no longer at MIT.” And while the university’s announcement does not name the author, both a preprint version of the paper and the initial press coverage identify him as Aidan Toner-Rodgers. (TechCrunch has reached out to Toner-Rodgers for comment.)/nMIT also says it has requested the paper be withdrawn from The Quarterly Journal of Economics, where it was submitted for publication, and from the preprint website arXiv. Apparently, only a paper’s authors are supposed to submit arXiv withdrawal requests, but MIT says “to date, the author has not done so.”/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/mit-disavows-doctoral-students-paper-on-ai-productivity-benefits/"
   },
   {
      "id": 3,
      "Title": "Laser-powered fusion experiment more than doubles its power output",
      "author": "Tim De Chant",
      "Publish Date": "16 hours ago",
      "Summary": "The world’s only net-positive fusion experiment has been steadily ramping up the amount of power it produces, TechCrunch has learned.",
      "Full Content": "The world’s only net-positive fusion experiment has been steadily ramping up the amount of power it produces, TechCrunch has learned./nIn recent attempts, the team at the U.S. Department of Energy’s National Ignition Facility (NIF) increased the yield of the experiment, first to 5.2 megajoules and then again to 8.6 megajoules, according to a source with knowledge of the experiment./nThe new results are significant improvements over the historic experiment in 2022, which was the first controlled fusion reaction to generate more energy than the it consumed./nThe 2022 shot generated 3.15 megajoules, a small bump over the 2.05 megajoules that the lasers delivered to the BB-sized fuel pellet./nNone of the shots to date have been effective enough to feed electrons back into the grid, let alone to offset the energy required to power the entire facility — the facility wasn’t designed to do that. The first net-positive shot, for example, required 300 megajoules to power the laser system alone. But they are continued proof that controlled nuclear fusion is more than hypothetical./nThe NIF uses what’s known as inertial confinement to produce fusion reactions. At the facility, fusion fuel is coated in diamond and then encased in a small gold cylinder called a hohlraum. That tiny pellet is dropped into a spherical vacuum chamber 10 meters in diameter, where 192 powerful laser beams converge on the target./nThe cylinder is vaporized under the onslaught, emitting X-rays in the process that bombard the fuel pellet inside. The pellet’s diamond coating receives so much energy that it turns into an expanding plasma, which compresses the deuterium-tritium fuel inside to the point where their nuclei fuse, releasing energy in the process./nThe other main approach to fusion, magnetic confinement, uses powerful superconducting magnets to compress and contain plasma in a space tight enough to create the conditions necessary for fusion. While no magnetic confinement experiments have produced net-positive results, several are being constructed or designed with the expectation that they’ll hit that milestone./nSeveral startups are pursuing inertial confinement, including Xcimer Energy and Focused Energy./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/laser-powered-fusion-experiment-more-than-doubles-its-power-output/"
   },
   {
      "id": 4,
      "Title": "TechCrunch Week in Review: Coinbase gets hacked",
      "author": "Karyne Levy",
      "Publish Date": "18 hours ago",
      "Summary": "Welcome back to Week in Review! We’ve got tons of news for you this week, including a hack at Coinbase; YC thinks Google is a ‘monopolist’; layoffs at Microsoft; and much more. Have a great weekend!",
      "Full Content": "Welcome back to Week in Review! We’ve got tons of news for you this week, including a hack at Coinbase; YC thinks Google is a ‘monopolist’; layoffs at Microsoft; and much more. Have a great weekend!/nUh-oh: Coinbase says that customers’ personal information, including government-issued IDs, was stolen in a data breach. The hackers demanded $20 million from the company, CEO Brian Armstrong said in a post on X. Coinbase said it will not pay the hackers’ ransom./nIPO time, baby: After filing confidentially in December, Chime filed for an IPO this week. There are a ton of blanks in the S-1, so we didn’t get much information, like how many shares insiders plan to sell as part of the IPO. But we did learn one tidbit: Chime entered a deal with the Dallas Mavericks in 2018, which gained it the Chime logo on the team’s jersey, among other marketing benefits./nKnock on wood: This story has been popping off all week — InventWood created wood called “Superwood” that’s as strong as steel. Ultimately, InventWood is planning to use wood chips to create structural beams of any dimension that won’t need finishing./nThis is TechCrunch’s Week in Review, where we recap the week’s biggest news. Want this delivered as a newsletter to your inbox every Saturday? Sign up here./nA big bowl of Granola: VCs and founders love talking up the apps they’re using. The most recent case: Granola, an AI note-taking app that’s recently seen a boost in usage, even though it launched a year ago. And when there’s usage, money follows. The company announced it has raised $43 million in a Series B funding round at a valuation of $250 million./nChoice words: “Google has chilled independent firms like YC from funding and accelerating innovative startups that could otherwise have challenged Google’s dominance,” YC wrote in an amicus brief it submitted in the U.S.’ antitrust case against the search giant. But YC isn’t calling for a complete breakup of Google./nLove to see it: Apple announced a bunch of accessibility features, including Accessibility Nutrition Labels that will inform users of accessibility features within apps and games in the App Store; a new magnifier for Macs; a new Braille experience; and more./nLayoffs at Microsoft: The company is reportedly laying off 3% of its workforce, or around 6,500 people, affecting all levels, locations, and teams. This follows a solid quarter for Microsoft, with $70.1 billion in revenue (up 13%) and net income profits of $25.8 billion (up 28%). In Washington, around 40% of the 2,000 people laid off were engineers./nGemini in your car: At the Android Show — Google’s Android-only event a week ahead of Google I/O — the company announced that it’s bringing Gemini to cars that support Android Auto. Drivers (and passengers) will be able to send texts, play music, and all the other things a smart assistant does, but using natural language./nLOL: What once was called HBO Go before it changed its name to HBO Now, which later became HBO Max, before settling on Max, announced this week that it’s once again changing its name back to HBO Max./nJust call it a bus: Uber is introducing Route Share, a commuter shuttle service that will pick up passengers at pre-set stops in 20-minute intervals. “You can see a natural extension of us being able to bring Route Share to autonomous vehicles as well,” Sachin Kansal, Uber’s chief product officer, told us./nWait, what? The New York Times spoke with two investors who said they were pitched a new startup that aims to deliver “human health optimization” using blood testing. Sound familiar? But wait till you hear who pitched the startup: Theranos founder Elizabeth Holmes’ partner, Billy Evans. Maybe it’ll work out better this time?/nAnd speaking of Uber: In 2022, senior reporter Rebecca Bellan wrote an article titled “The Amazonification of Uber” about how the company was becoming more of a closed loop to keep customers engaged. Now the company is taking it a step further, introducing Uber One Member Days, a week of discounts designed to boost its subscription program and expand its role beyond transportation./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/techcrunch-week-in-review-coinbase-gets-hacked/"
   },
   {
      "id": 5,
      "Title": "Epic Games asks judge to force Apple to approve Fortnite",
      "author": "Anthony Ha",
      "Publish Date": "19 hours ago",
      "Summary": "Epic Games is escalating its efforts to pressure Apple to allow its game Fortnite into its App Store, with a new court filing asking Judge Yvonne Gonzalez Rogers to require that Apple “accept any compliant version of Fortnite onto the U.S. storefront of the App Store.”",
      "Full Content": "Epic Games is escalating its efforts to pressure Apple to allow its game Fortnite into its App Store, with a new court filing asking Judge Yvonne Gonzalez Rogers to require that Apple “accept any compliant version of Fortnite onto the U.S. storefront of the App Store.”/nEpic and Apple have been engaged in a years-long legal battle over Apple’s App Store policies, particularly the commissions Apple charges for in-app purchases./nThe Fortnite publisher scored a major victory last month when Judge Rogers ruled that Apple was in “willful violation” of an injunction on anti-competitive pricing — a ruling that seemed to pave the way for Fortnite to return to the App Store, and more broadly, for developers to offer alternative payment options in their apps./nHowever, Apple said it will appeal the ruling, and on Friday, Epic said Friday the company is blocking Fortnite from both its U.S. App Store and preventing it from being released on the Epic Games store in Europe: “Now, sadly, Fortnite on iOS will be offline worldwide until Apple unblocks it.”/nApple disputed this characterization, specifically the suggestion that it was blocking Fortnite outside the United States. Instead, the company said it asked Epic Sweden to “resubmit the app update without including the U.S. storefront of the App Store so as not to impact Fortnite in other geographies.”/nBut why block Fortnite in the United States? Epic released a letter signed by Mark A. Perry, an attorney representing Apple, telling Epic’s lawyers that “Apple has determined not to take action on the Fortnite app submission until after the Ninth Circuit rules on our pending request for a partial stay of the new injunction.”/nIn its filing, Epic argues that Apple is denying it “the ability to take advantage of the pro-competitive rules it helped usher in,” and “punishing” Epic “by shutting it out of the very market it has fought so hard to open — while sending a clear message to other developers not to challenge Apple’s practices.”/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/epic-games-asks-judge-to-force-apple-to-approve-fortnite/"
   },
   {
      "id": 6,
      "Title": "Y Combinator startup Firecrawl is ready to pay $1M to hire three AI agents as employees",
      "author": "Julie Bort",
      "Publish Date": "20 hours ago",
      "Summary": "Y Combinator-backed startup Firecrawl is back on the hunt for AI agent employees. As we reported back in February, its first attempt didn’t yield an AI worth hiring.",
      "Full Content": "Y Combinator-backed startup Firecrawl is back on the hunt for AI agent employees. As we reported back in February, its first attempt didn’t yield an AI worth hiring./nBut it’s now placed three new ads on YC’s job board for “AI agents only” and has set aside a $1 million budget total to make it happen./nWithin about a week after the new job posts went live, it had about 50 applicants, founder Caleb Peffer tells TechCrunch./nFirecrawl offers a web crawling tool that scrapes data from websites for LLMs. This is, Peffer admits, a shady part of the AI ecosystem where bad behaving web crawlers can sometimes pound websites like DDoS attacks. But Firewcrawl has gained popularity by trying to bring in some guardrails, he says./nFor instance, many of its customers are enterprises scraping their own data for internal LLM use. Some websites want their data included in chatbot responses, just like they want Google links, he says. Additionally, the tool honors robot.txt settings and can be set to only scrape a public website once and share the data with others./nConsequently, one job opening is for a content creation agent “that never sleeps and always ships” that will autonomously produce “high quality” SEO-pleasing blog posts and tutorials on how to use its product, the startup’s ad says. Firecrawl wants this AI to watch engagement metrics and use that to autonomously improve the audience for its content, too./nIn other words: the agent should decide what to create, create it, post it, measure the audience, and grow mastery from that feedback, autonomously. If you are a borderline AGI AI made for blogging, this could be the job for you. The advertised pay is $5,000 a month./nThe company is also looking for a customer support engineer agent that will be tasked with crafting the AI workflow that responds to customer issues within two minutes and can handle tickets on its own, knowing when to escalate to a human. Previous experience doing customer support is requested. Pay is also $5,000/month./nThe third opening is for a junior developer agent who’ll be tasked with prioritizing incoming Github issues, writing documentation and writing code in TypeScript and Go. Once again, the pay also $5,000/month./nBut here’s the catch: Firecrawl is also hoping to hire human creator or creators behind these bots — and the $1 million budget is for hiring both agents and humans, though it’s not clear how many years the budget is supposed to cover. The startup might hire the humans full time, or as contractors (which might make more sense if they’re creating lots of agents for lots of companies). Firecrawl is also entertaining bids from other startups that specialize in creating the types of agents that it’s looking for, say in customer service, Peffer says./nThe truth is, the AI employee of Firecrawl’s dreams doesn’t exist yet. Maybe it never will./n“AI can’t replace humans today,” Peffer says. ”The future, what we see, is a world where the next 10x engineers are operating armies of agents, AI systems that they’re building, maintaining, and monitoring. What we want to do is work with people that want to be those agent operators.”/nFirecrawl is not the only one. YC’s job board is full of jobs for developers of agents. Will their creations ever replace them as Silicon Valley is continuously wishing? That’s the real million-dollar question./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/y-combinator-startup-firecrawl-is-ready-to-pay-1m-to-hire-three-ai-agents-as-employees/"
   },
   {
      "id": 7,
      "Title": "Build, don’t bind: Accel’s Sonali De Rycker on Europe’s AI crossroads",
      "author": "Connie Loizos",
      "Publish Date": "1 day ago",
      "Summary": "Sonali De Rycker,  a general partner at Accel and one of Europe’s most influential venture capitalists, is bullish about the continent’s prospects in AI. But she’s wary of regulatory overreach that could hamstring its momentum.",
      "Full Content": "Sonali De Rycker,  a general partner at Accel and one of Europe’s most influential venture capitalists, is bullish about the continent’s prospects in AI. But she’s wary of regulatory overreach that could hamstring its momentum./nAt a TechCrunch StrictlyVC evening earlier this week in London, De Rycker reflected on Europe’s place in the global AI race, balancing optimism with realism. “We have all the pieces,” she told those gathered for the event. “We have the entrepreneurs, we have the ambition, we have the schools, we have the capital, and we have the talent.” All that’s missing, she argued, is the ability to “unleash” that potential at scale./nThe obstacle? Europe’s complex regulatory landscape and, in part, its pioneering but controversial Artificial Intelligence Act./nDe Rycker acknowledged that regulations have a role to play. Still, she said she worries that the AI Act’s broad reach and potentially stifling fines could deter innovation at the very moment European startups need space to iterate and grow. While the goals of ethical AI and consumer protection are laudable, she fears the net may be cast too wide./n“There’s a real opportunity to make sure that we go fast and address what we’re capable of,” she said. “The issue is that we are also faced with headwinds on regulation.”/nThat urgency is amplified by shifting geopolitics. With U.S. support for Europe’s defense and economic autonomy waning under the current Trump administration, De Rycker sees this moment as a decisive one for the EU.  “Now that Europe is being left to fend [for itself] in multiple ways,” she said, “we need to be self-sufficient, we need to be sovereign.”/nThat means unlocking Europe’s full potential. De Rycker points to efforts like the “28th regime,” a framework aimed at creating a single set of rules for businesses across the EU, as crucial to creating a more unified, startup-friendly region. Currently, the mishmash of labor laws, licensing, and corporate structures across the countries creates friction and slows down progress./n“If we were truly one region, the power you could unleash would be incredible,” she said. “We wouldn’t be having these same conversations about Europe lagging in tech.”/nIn De Rycker’s view, Europe is catching up. Cities like Zurich, Munich, Paris, and London are starting to generate their own self-reinforcing ecosystems thanks to top-tier academic institutions and a growing base of experienced founders. Accel, for its part, has invested in over 70 cities across Europe and Israel, giving De Rycker a front-row seat to the continent’s fragmented but flourishing tech landscape./nStill, on Tuesday night, she noted a stark contrast with the U.S. when it comes to adoption. “We see a lot more propensity for customers to experiment with AI in the U.S.,” she said. Meanwhile, U.S investors are “spending money on these kinds of speculative, early-stage companies. That flywheel keeps going.”/nAccel, whose London team closed their newest fund with $650 million last year, can afford to lean in a bit more than many other regional players. It hasn’t backed any of the major foundational AI model companies like OpenAI or Anthropic but is instead focused on the application layer. “We feel very comfortable with the application layer,” said De Rycker. “These foundational models are capital intensive and don’t really look like venture-backed companies.”/nExamples of promising bets include Synthesia, a video generation platform used in enterprise training, and Speak, a language learning app that recently jumped to a $1 billion valuation./nDe Rycker (who dodged questions about Accel’s reported talks with another big name in AI), sees these as early examples of how AI can create entirely new behaviors and business models. “We’re expanding total addressable markets at a rate we’ve never seen,” she said. “It feels like the early days of mobile. DoorDash and Uber weren’t just mobilized websites. They were brand new paradigms.”/nUltimately, De Rycker sees this moment as both a challenge and a once-in-a-generation opportunity. If Europe leans too heavily into regulation, it risks stifling the innovation that could help it compete globally – not just in AI, but across the entire tech spectrum./n“We’re in a supercycle,” she said. “These cycles don’t come often, and we can’t afford to be leashed.”/nWith geopolitical uncertainty rising and the U.S. increasingly looking inward, Europe has little choice but to bet on itself. If it can strike the right balance, De Rycker believes it has everything it needs to lead./nOn Tuesday, asked by one attendee of the event what EU founders can do to be more competitive with their U.S. counterparts, she didn’t hesitate. “I think they are [competitive],” she said, citing companies Accel has backed, including Supercell and Spotify. “These founders, they look no different.”/nYou can catch catch the full conversation with De Rycker here :/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/16/build-dont-bind-accels-sonali-de-rycker-on-europes-ai-crossroads/"
   },
   {
      "id": 8,
      "Title": "OpenAI’s planned data center in Abu Dhabi would be bigger than Monaco",
      "author": "Connie Loizos",
      "Publish Date": "2 days ago",
      "Summary": "OpenAI is poised to help develop a staggering 5-gigawatt data center campus in Abu Dhabi, positioning the company as a primary anchor tenant in what could become one of the world’s largest AI infrastructure projects, according to a new Bloomberg report.",
      "Full Content": "OpenAI is poised to help develop a staggering 5-gigawatt data center campus in Abu Dhabi, positioning the company as a primary anchor tenant in what could become one of the world’s largest AI infrastructure projects, according to a new Bloomberg report./nThe facility would reportedly span an astonishing 10 square miles and consume power equivalent to five nuclear reactors, dwarfing any existing AI infrastructure announced by OpenAI or its competitors. (OpenAI has not yet returned TechCrunch’s request for comment, but to put that into perspective, that’s bigger than Monaco.)/nThe UAE project, developed in partnership with G42 — an Abu Dhabi-based tech conglomerate — is part of OpenAI’s ambitious Stargate project, a joint venture announced in January that could see OpenAI, SoftBank, and Oracle build massive data centers around the globe stocked with powerful computer chips to support AI development./nWhile OpenAI’s first Stargate campus in the U.S. — already under development in Abilene, Texas — is expected to reach 1.2 gigawatts, this Middle Eastern counterpart would more than quadruple that capacity./nThe project is emerging amid broader AI ties between the U.S. and UAE that have been years in the making, and have made some lawmakers nervous./nOpenAI’s relationship with the UAE dates back to a 2023 partnership with G42 aimed at driving AI adoption in the Middle East. During a talk earlier that same year in Abu Dhabi, OpenAI CEO Sam Altman praised the UAE, saying it “has been talking about AI since before it was cool.”/nAs with much of the AI world, these relationships are… complicated. Founded in 2018, G42 is chaired by Sheikh Tahnoon bin Zayed Al Nahyan, the UAE’s national security advisor and younger brother of the country’s ruler. Its embrace by OpenAI raised concerns in late 2023 among U.S. officials, who feared that G42 could enable China’s government to gain access to advanced U.S. technology./nThese concerns focused on G42’s “active relationships” with blacklisted entities, including Huawei and Beijing Genomics Institute, as well as ties to individuals connected to China’s intelligence efforts./nFollowing pressure from U.S. lawmakers, G42’s CEO told Bloomberg in early 2024 that the company was shifting its strategy, saying: “All of our China investments that were previously made are already divested. Because of that, of course, we have no need anymore for any physical China presence.”/nSoon after, Microsoft — a major shareholder in OpenAI with its own broader interests in the region — announced a $1.5 billion investment in G42, and its president, Brad Smith, joined G42’s board of directors./n/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/16/openais-planned-data-center-in-abu-dhabi-would-be-bigger-than-monaco/"
   },
   {
      "id": 9,
      "Title": "Google I/O 2025: What to expect, including updates to Gemini and Android 16",
      "author": "Kyle Wiggers",
      "Publish Date": "2 days ago",
      "Summary": "Google I/O, Google’s biggest developer conference of the year, is nearly upon us.",
      "Full Content": "Google I/O, Google’s biggest developer conference of the year, is nearly upon us./nScheduled for May 20 to 21 at the Shoreline Amphitheatre in Mountain View, I/O will showcase product announcements from across Google’s portfolio. Expect plenty of news relating to Android, Chrome, Google Search, YouTube, and — of course — Google’s AI-powered chatbot, Gemini./nEarlier this week, Google hosted a separate event dedicated to Android updates: The Android Show. The company announced new ways to find lost Android phones and other items, additional device-level features for its Advanced Protection program, security tools to protect against scams and theft, and a new design language called Material 3 Expressive./nHere’s what else you can expect./nWe’ll likely learn about other aspects of Android 16 during I/O proper./nAndroid 16 is expected to bring with it improved notifications. Otherwise, it’s mostly a quality-of-life update, judging by reports. It’ll introduce support for Auracast, which should make it easier to switch between Bluetooth devices. Also in tow are lock screen widgets and a range of new accessibility features./nGoogle may also spotlight capabilities in the latest versions of Android XR, its mixed reality operating system, and Wear OS, the company’s software for wearables./nAI is the tech du jour, and Google, like its rivals, has been investing heavily in it./nA shoo-in for I/O is a new addition (or several) to Google’s flagship Gemini family of AI models. Leaks over the past few weeks suggest that an updated Gemini Ultra model is on the way, Gemini Ultra being Google’s top-of-the-line Gemini offering./nWith this upgraded Gemini Ultra may come a pricier Gemini subscription./nGoogle offers a single premium tier, Gemini Advanced ($20 per month), to unlock additional capabilities in its Gemini chatbot, which is powered by the company’s Gemini models. But Google may soon launch two new plans, Premium Plus and Premium Pro. It’s not yet clear what benefits might be attached and how these plans might be priced relative to Gemini Advanced./nGoogle will almost certainly talk about Astra, its wide-ranging effort to build AI apps and “agents” for real-time, multimodal understanding. Also probably on the agenda is Project Mariner, Google’s AI “agents” that can navigate and take action across the web on a user’s behalf. Folks on X spotted references to “Computer Use” in the code for Google’s AI Studio developer platform, which could well pertain to Mariner./nGoing by the official I/O schedule, Google will have plenty to discuss following The Android Show and I/O keynote addresses./nThe schedule lists sessions dedicated to Chrome and Google Cloud, Google Play (the Android app store), Android development tools, and Gemma, Google’s collection of “open” AI models./nLast year, Google unveiled a few AI-themed surprises at I/O, including a set of models fine-tuned for education applications called LearnLM. An upgrade to Google’s viral podcast-generating NotebookLM could be one such surprise. Leaked code reveals a “Video Overviews” tool that presumably would create video summaries, most likely leveraging Google’s Veo 2 video-generating model./nUpdated: 3:19 p.m. Pacific: Added a list of new Android features announced during The Android Show./n/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/16/google-i-o-2025-what-to-expect-including-updates-to-gemini-and-android-16/"
   },
   {
      "id": 10,
      "Title": "Thousands of people have embarked on a virtual road trip via Google Street View",
      "author": "Amanda Silberling",
      "Publish Date": "2 days ago",
      "Summary": "It’s Friday afternoon and I’m listening to Bowdoin College’s radio station, interspersed with ambient car honking noises. I am not in Maine. I am not in a car. I am at my desk. This is Internet Roadtrip.",
      "Full Content": "It’s Friday afternoon and I’m listening to Bowdoin College’s radio station, interspersed with ambient car honking noises. I am not in Maine. I am not in a car. I am at my desk. This is Internet Roadtrip./nInternet Roadtrip is what I will call an MMORTG (massive multiplayer online road trip game). Neal Agarwal, the game’s creator, calls it a “road-trip simulator.” Every 10 seconds, viewers vote on what direction for the “car” to drive on Google Street View — or, you can vote to honk the horn or change the radio station. The direction with the most votes gets clicked, and the car continues on its scenic path to … wherever the chat decides to go./nInternet Roadtrip is reminiscent of Twitch Plays Pokémon, an iconic stream from over 10 years ago in which viewers voted on what button to press as part of a collective Pokémon Red game. But Internet Roadtrip is far less chaotic — both because only a thousand or so people are playing at a time, and because we have better organizational tools than we did in the Twitch Plays Pokémon era (thank you, Discord)./nProgress on the virtual roadtrip is slow. The car moves at a pace slower than walking. Discord moderators have had to temper newcomers’ expectations, explaining that it’s pointless to suggest driving to Las Vegas from Maine, since it would likely take almost 10 months of real-world time to get there. The same goes for Alaska, but it’s not just a matter of time that’s the issue./n“Google Street View works by taking multiple pictures and putting them together. In some areas of the roads leading to Alaska, there are gaps in pictures available and so we would get stuck there, were we to go to these roads,” the Discord FAQ reads. “All potential roads to Alaska have these gaps. We checked.”/nThere is no objective on Internet Roadtrip, as opposed other Street View-based games like GeoGuessr. Some Discord members discussed driving to Canada, which is a somewhat realistic goal, given our current position in Maine. But the destination isn’t the goal — it’s the joy of spontaneously listening to a college radio from a liberal arts school with a thousand strangers on the internet, while taking in the scenic backroads of Blue Hill, Maine./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/16/thousands-of-people-have-embarked-on-a-virtual-road-trip-via-google-street-view/"
   },
   {
      "id": 11,
      "Title": "",
      "author": "Anthony Ha",
      "Publish Date": " ",
      "Summary": "While Microsoft CEO Satya Nadella says he likes podcasts, he might not actually be listening to them anymore.",
      "Full Content": "Posted:/nWhile Microsoft CEO Satya Nadella says he likes podcasts, he might not actually be listening to them anymore./nThat tidbit comes towards the end of a longer Bloomberg profile of Nadella, with a focus on Microsoft’s AI strategy and its complicated relationship with OpenAI. To illustrate how much he uses the company’s Copilot AI assistant in his daily life, Nadella said that instead of listening to podcasts, he now uploads the transcripts to Copilot, then talks to Copilot about the content during his drive to the office./nIn addition, Nadella — who jokingly described his job as “email typist” — said he relies on at least 10 custom agents developed in Copilot Studio to summarize emails and messages, prepare for meetings, and perform other tasks around the office./nAI already seems to be transforming Microsoft in more substantial ways, with programers reportedly the hardest hit in the company’s recent layoffs, shortly after Nadella declared that 30% of the company’s code was written by AI./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/microsofts-satya-nadella-is-choosing-chatbots-over-podcasts/"
   },
   {
      "id": 12,
      "Title": "",
      "author": "Anthony Ha",
      "Publish Date": " ",
      "Summary": "MIT says that due to concerns about the “integrity” of a high-profile paper about the effects of artificial intelligence on research and innovation, the paper should be “withdrawn from public discourse.”",
      "Full Content": "MIT says that due to concerns about the “integrity” of a high-profile paper about the effects of artificial intelligence on research and innovation, the paper should be “withdrawn from public discourse.”/nThe paper in question, “Artificial Intelligence, Scientific Discovery, and Product Innovation,” was written by a doctoral student in the university’s economics program. It claimed to show that the introduction of an AI tool into a large-but-unidentified materials science lab led to the discovery of more materials and more patent filings, but at the cost of reducing researchers’ satisfaction with their work./nMIT economists Daron Acemoglu (who recently won the Nobel Prize) and David Autor both praised the paper last year, with Autor telling the Wall Street Journal he was “floored.” In a statement included in MIT’s announcement on Friday, Acemoglu and Autor described the paper as “already known and discussed extensively in the literature on AI and science, even though it has not been published in any refereed journal.”/nHowever, the two economists said they now have “no confidence in the provenance, reliability or validity of the data and in the veracity of the research.”/nAccording to the WSJ, a computer scientist with experience in materials science approached Acemoglu and Autor with concerns in January. They brought those concerns to MIT, leading to an internal review./nMIT says that due to student privacy laws, it cannot disclose the results of that review, but the paper’s author is “no longer at MIT.” And while the university’s announcement does not name the author, both a preprint version of the paper and the initial press coverage identify him as Aidan Toner-Rodgers. (TechCrunch has reached out to Toner-Rodgers for comment.)/nMIT also says it has requested the paper be withdrawn from The Quarterly Journal of Economics, where it was submitted for publication, and from the preprint website arXiv. Apparently, only a paper’s authors are supposed to submit arXiv withdrawal requests, but MIT says “to date, the author has not done so.”/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/mit-disavows-doctoral-students-paper-on-ai-productivity-benefits/"
   },
   {
      "id": 13,
      "Title": "",
      "author": "Tim De Chant",
      "Publish Date": " ",
      "Summary": "The world’s only net-positive fusion experiment has been steadily ramping up the amount of power it produces, TechCrunch has learned.",
      "Full Content": "The world’s only net-positive fusion experiment has been steadily ramping up the amount of power it produces, TechCrunch has learned./nIn recent attempts, the team at the U.S. Department of Energy’s National Ignition Facility (NIF) increased the yield of the experiment, first to 5.2 megajoules and then again to 8.6 megajoules, according to a source with knowledge of the experiment./nThe new results are significant improvements over the historic experiment in 2022, which was the first controlled fusion reaction to generate more energy than the it consumed./nThe 2022 shot generated 3.15 megajoules, a small bump over the 2.05 megajoules that the lasers delivered to the BB-sized fuel pellet./nNone of the shots to date have been effective enough to feed electrons back into the grid, let alone to offset the energy required to power the entire facility — the facility wasn’t designed to do that. The first net-positive shot, for example, required 300 megajoules to power the laser system alone. But they are continued proof that controlled nuclear fusion is more than hypothetical./nThe NIF uses what’s known as inertial confinement to produce fusion reactions. At the facility, fusion fuel is coated in diamond and then encased in a small gold cylinder called a hohlraum. That tiny pellet is dropped into a spherical vacuum chamber 10 meters in diameter, where 192 powerful laser beams converge on the target./nThe cylinder is vaporized under the onslaught, emitting X-rays in the process that bombard the fuel pellet inside. The pellet’s diamond coating receives so much energy that it turns into an expanding plasma, which compresses the deuterium-tritium fuel inside to the point where their nuclei fuse, releasing energy in the process./nThe other main approach to fusion, magnetic confinement, uses powerful superconducting magnets to compress and contain plasma in a space tight enough to create the conditions necessary for fusion. While no magnetic confinement experiments have produced net-positive results, several are being constructed or designed with the expectation that they’ll hit that milestone./nSeveral startups are pursuing inertial confinement, including Xcimer Energy and Focused Energy./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/laser-powered-fusion-experiment-more-than-doubles-its-power-output/"
   },
   {
      "id": 14,
      "Title": "",
      "author": "Karyne Levy",
      "Publish Date": " ",
      "Summary": "Welcome back to Week in Review! We’ve got tons of news for you this week, including a hack at Coinbase; YC thinks Google is a ‘monopolist’; layoffs at Microsoft; and much more. Have a great weekend!",
      "Full Content": "Welcome back to Week in Review! We’ve got tons of news for you this week, including a hack at Coinbase; YC thinks Google is a ‘monopolist’; layoffs at Microsoft; and much more. Have a great weekend!/nUh-oh: Coinbase says that customers’ personal information, including government-issued IDs, was stolen in a data breach. The hackers demanded $20 million from the company, CEO Brian Armstrong said in a post on X. Coinbase said it will not pay the hackers’ ransom./nIPO time, baby: After filing confidentially in December, Chime filed for an IPO this week. There are a ton of blanks in the S-1, so we didn’t get much information, like how many shares insiders plan to sell as part of the IPO. But we did learn one tidbit: Chime entered a deal with the Dallas Mavericks in 2018, which gained it the Chime logo on the team’s jersey, among other marketing benefits./nKnock on wood: This story has been popping off all week — InventWood created wood called “Superwood” that’s as strong as steel. Ultimately, InventWood is planning to use wood chips to create structural beams of any dimension that won’t need finishing./nThis is TechCrunch’s Week in Review, where we recap the week’s biggest news. Want this delivered as a newsletter to your inbox every Saturday? Sign up here./nA big bowl of Granola: VCs and founders love talking up the apps they’re using. The most recent case: Granola, an AI note-taking app that’s recently seen a boost in usage, even though it launched a year ago. And when there’s usage, money follows. The company announced it has raised $43 million in a Series B funding round at a valuation of $250 million./nChoice words: “Google has chilled independent firms like YC from funding and accelerating innovative startups that could otherwise have challenged Google’s dominance,” YC wrote in an amicus brief it submitted in the U.S.’ antitrust case against the search giant. But YC isn’t calling for a complete breakup of Google./nLove to see it: Apple announced a bunch of accessibility features, including Accessibility Nutrition Labels that will inform users of accessibility features within apps and games in the App Store; a new magnifier for Macs; a new Braille experience; and more./nLayoffs at Microsoft: The company is reportedly laying off 3% of its workforce, or around 6,500 people, affecting all levels, locations, and teams. This follows a solid quarter for Microsoft, with $70.1 billion in revenue (up 13%) and net income profits of $25.8 billion (up 28%). In Washington, around 40% of the 2,000 people laid off were engineers./nGemini in your car: At the Android Show — Google’s Android-only event a week ahead of Google I/O — the company announced that it’s bringing Gemini to cars that support Android Auto. Drivers (and passengers) will be able to send texts, play music, and all the other things a smart assistant does, but using natural language./nLOL: What once was called HBO Go before it changed its name to HBO Now, which later became HBO Max, before settling on Max, announced this week that it’s once again changing its name back to HBO Max./nJust call it a bus: Uber is introducing Route Share, a commuter shuttle service that will pick up passengers at pre-set stops in 20-minute intervals. “You can see a natural extension of us being able to bring Route Share to autonomous vehicles as well,” Sachin Kansal, Uber’s chief product officer, told us./nWait, what? The New York Times spoke with two investors who said they were pitched a new startup that aims to deliver “human health optimization” using blood testing. Sound familiar? But wait till you hear who pitched the startup: Theranos founder Elizabeth Holmes’ partner, Billy Evans. Maybe it’ll work out better this time?/nAnd speaking of Uber: In 2022, senior reporter Rebecca Bellan wrote an article titled “The Amazonification of Uber” about how the company was becoming more of a closed loop to keep customers engaged. Now the company is taking it a step further, introducing Uber One Member Days, a week of discounts designed to boost its subscription program and expand its role beyond transportation./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/techcrunch-week-in-review-coinbase-gets-hacked/"
   },
   {
      "id": 15,
      "Title": "",
      "author": "Anthony Ha",
      "Publish Date": " ",
      "Summary": "Epic Games is escalating its efforts to pressure Apple to allow its game Fortnite into its App Store, with a new court filing asking Judge Yvonne Gonzalez Rogers to require that Apple “accept any compliant version of Fortnite onto the U.S. storefront of the App Store.”",
      "Full Content": "Epic Games is escalating its efforts to pressure Apple to allow its game Fortnite into its App Store, with a new court filing asking Judge Yvonne Gonzalez Rogers to require that Apple “accept any compliant version of Fortnite onto the U.S. storefront of the App Store.”/nEpic and Apple have been engaged in a years-long legal battle over Apple’s App Store policies, particularly the commissions Apple charges for in-app purchases./nThe Fortnite publisher scored a major victory last month when Judge Rogers ruled that Apple was in “willful violation” of an injunction on anti-competitive pricing — a ruling that seemed to pave the way for Fortnite to return to the App Store, and more broadly, for developers to offer alternative payment options in their apps./nHowever, Apple said it will appeal the ruling, and on Friday, Epic said Friday the company is blocking Fortnite from both its U.S. App Store and preventing it from being released on the Epic Games store in Europe: “Now, sadly, Fortnite on iOS will be offline worldwide until Apple unblocks it.”/nApple disputed this characterization, specifically the suggestion that it was blocking Fortnite outside the United States. Instead, the company said it asked Epic Sweden to “resubmit the app update without including the U.S. storefront of the App Store so as not to impact Fortnite in other geographies.”/nBut why block Fortnite in the United States? Epic released a letter signed by Mark A. Perry, an attorney representing Apple, telling Epic’s lawyers that “Apple has determined not to take action on the Fortnite app submission until after the Ninth Circuit rules on our pending request for a partial stay of the new injunction.”/nIn its filing, Epic argues that Apple is denying it “the ability to take advantage of the pro-competitive rules it helped usher in,” and “punishing” Epic “by shutting it out of the very market it has fought so hard to open — while sending a clear message to other developers not to challenge Apple’s practices.”/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/epic-games-asks-judge-to-force-apple-to-approve-fortnite/"
   },
   {
      "id": 16,
      "Title": "",
      "author": "Julie Bort",
      "Publish Date": " ",
      "Summary": "Y Combinator-backed startup Firecrawl is back on the hunt for AI agent employees. As we reported back in February, its first attempt didn’t yield an AI worth hiring.",
      "Full Content": "Y Combinator-backed startup Firecrawl is back on the hunt for AI agent employees. As we reported back in February, its first attempt didn’t yield an AI worth hiring./nBut it’s now placed three new ads on YC’s job board for “AI agents only” and has set aside a $1 million budget total to make it happen./nWithin about a week after the new job posts went live, it had about 50 applicants, founder Caleb Peffer tells TechCrunch./nFirecrawl offers a web crawling tool that scrapes data from websites for LLMs. This is, Peffer admits, a shady part of the AI ecosystem where bad behaving web crawlers can sometimes pound websites like DDoS attacks. But Firewcrawl has gained popularity by trying to bring in some guardrails, he says./nFor instance, many of its customers are enterprises scraping their own data for internal LLM use. Some websites want their data included in chatbot responses, just like they want Google links, he says. Additionally, the tool honors robot.txt settings and can be set to only scrape a public website once and share the data with others./nConsequently, one job opening is for a content creation agent “that never sleeps and always ships” that will autonomously produce “high quality” SEO-pleasing blog posts and tutorials on how to use its product, the startup’s ad says. Firecrawl wants this AI to watch engagement metrics and use that to autonomously improve the audience for its content, too./nIn other words: the agent should decide what to create, create it, post it, measure the audience, and grow mastery from that feedback, autonomously. If you are a borderline AGI AI made for blogging, this could be the job for you. The advertised pay is $5,000 a month./nThe company is also looking for a customer support engineer agent that will be tasked with crafting the AI workflow that responds to customer issues within two minutes and can handle tickets on its own, knowing when to escalate to a human. Previous experience doing customer support is requested. Pay is also $5,000/month./nThe third opening is for a junior developer agent who’ll be tasked with prioritizing incoming Github issues, writing documentation and writing code in TypeScript and Go. Once again, the pay also $5,000/month./nBut here’s the catch: Firecrawl is also hoping to hire human creator or creators behind these bots — and the $1 million budget is for hiring both agents and humans, though it’s not clear how many years the budget is supposed to cover. The startup might hire the humans full time, or as contractors (which might make more sense if they’re creating lots of agents for lots of companies). Firecrawl is also entertaining bids from other startups that specialize in creating the types of agents that it’s looking for, say in customer service, Peffer says./nThe truth is, the AI employee of Firecrawl’s dreams doesn’t exist yet. Maybe it never will./n“AI can’t replace humans today,” Peffer says. ”The future, what we see, is a world where the next 10x engineers are operating armies of agents, AI systems that they’re building, maintaining, and monitoring. What we want to do is work with people that want to be those agent operators.”/nFirecrawl is not the only one. YC’s job board is full of jobs for developers of agents. Will their creations ever replace them as Silicon Valley is continuously wishing? That’s the real million-dollar question./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/y-combinator-startup-firecrawl-is-ready-to-pay-1m-to-hire-three-ai-agents-as-employees/"
   },
   {
      "id": 17,
      "Title": "",
      "author": "Connie Loizos",
      "Publish Date": " ",
      "Summary": "Sonali De Rycker,  a general partner at Accel and one of Europe’s most influential venture capitalists, is bullish about the continent’s prospects in AI. But she’s wary of regulatory overreach that could hamstring its momentum.",
      "Full Content": "Sonali De Rycker,  a general partner at Accel and one of Europe’s most influential venture capitalists, is bullish about the continent’s prospects in AI. But she’s wary of regulatory overreach that could hamstring its momentum./nAt a TechCrunch StrictlyVC evening earlier this week in London, De Rycker reflected on Europe’s place in the global AI race, balancing optimism with realism. “We have all the pieces,” she told those gathered for the event. “We have the entrepreneurs, we have the ambition, we have the schools, we have the capital, and we have the talent.” All that’s missing, she argued, is the ability to “unleash” that potential at scale./nThe obstacle? Europe’s complex regulatory landscape and, in part, its pioneering but controversial Artificial Intelligence Act./nDe Rycker acknowledged that regulations have a role to play. Still, she said she worries that the AI Act’s broad reach and potentially stifling fines could deter innovation at the very moment European startups need space to iterate and grow. While the goals of ethical AI and consumer protection are laudable, she fears the net may be cast too wide./n“There’s a real opportunity to make sure that we go fast and address what we’re capable of,” she said. “The issue is that we are also faced with headwinds on regulation.”/nThat urgency is amplified by shifting geopolitics. With U.S. support for Europe’s defense and economic autonomy waning under the current Trump administration, De Rycker sees this moment as a decisive one for the EU.  “Now that Europe is being left to fend [for itself] in multiple ways,” she said, “we need to be self-sufficient, we need to be sovereign.”/nThat means unlocking Europe’s full potential. De Rycker points to efforts like the “28th regime,” a framework aimed at creating a single set of rules for businesses across the EU, as crucial to creating a more unified, startup-friendly region. Currently, the mishmash of labor laws, licensing, and corporate structures across the countries creates friction and slows down progress./n“If we were truly one region, the power you could unleash would be incredible,” she said. “We wouldn’t be having these same conversations about Europe lagging in tech.”/nIn De Rycker’s view, Europe is catching up. Cities like Zurich, Munich, Paris, and London are starting to generate their own self-reinforcing ecosystems thanks to top-tier academic institutions and a growing base of experienced founders. Accel, for its part, has invested in over 70 cities across Europe and Israel, giving De Rycker a front-row seat to the continent’s fragmented but flourishing tech landscape./nStill, on Tuesday night, she noted a stark contrast with the U.S. when it comes to adoption. “We see a lot more propensity for customers to experiment with AI in the U.S.,” she said. Meanwhile, U.S investors are “spending money on these kinds of speculative, early-stage companies. That flywheel keeps going.”/nAccel, whose London team closed their newest fund with $650 million last year, can afford to lean in a bit more than many other regional players. It hasn’t backed any of the major foundational AI model companies like OpenAI or Anthropic but is instead focused on the application layer. “We feel very comfortable with the application layer,” said De Rycker. “These foundational models are capital intensive and don’t really look like venture-backed companies.”/nExamples of promising bets include Synthesia, a video generation platform used in enterprise training, and Speak, a language learning app that recently jumped to a $1 billion valuation./nDe Rycker (who dodged questions about Accel’s reported talks with another big name in AI), sees these as early examples of how AI can create entirely new behaviors and business models. “We’re expanding total addressable markets at a rate we’ve never seen,” she said. “It feels like the early days of mobile. DoorDash and Uber weren’t just mobilized websites. They were brand new paradigms.”/nUltimately, De Rycker sees this moment as both a challenge and a once-in-a-generation opportunity. If Europe leans too heavily into regulation, it risks stifling the innovation that could help it compete globally – not just in AI, but across the entire tech spectrum./n“We’re in a supercycle,” she said. “These cycles don’t come often, and we can’t afford to be leashed.”/nWith geopolitical uncertainty rising and the U.S. increasingly looking inward, Europe has little choice but to bet on itself. If it can strike the right balance, De Rycker believes it has everything it needs to lead./nOn Tuesday, asked by one attendee of the event what EU founders can do to be more competitive with their U.S. counterparts, she didn’t hesitate. “I think they are [competitive],” she said, citing companies Accel has backed, including Supercell and Spotify. “These founders, they look no different.”/nYou can catch catch the full conversation with De Rycker here :/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/16/build-dont-bind-accels-sonali-de-rycker-on-europes-ai-crossroads/"
   },
   {
      "id": 18,
      "Title": "TC Sessions: AI",
      "author": "No Author",
      "Publish Date": " ",
      "Summary": "COUNTDOWN TO TC SESSIONS: AI. Click here to save up to $600 on tickets.",
      "Full Content": "COUNTDOWN TO TC SESSIONS: AI. Click here to save up to $600 on tickets./nCOUNTDOWN TO TC SESSIONS: AI. Click here to save up to $600 on tickets./nAt this TechCrunch Sessions event, we’ll explore the vast world of artificial intelligence alongside industry visionaries./nOur agenda includes a deep focus on the startup ecosystem, covering strategies for pitching, building, and scaling AI-powered businesses, while also highlighting where investors are directing their funds./nWe’ll also take a closer look at AI infrastructure  and tools, focusing on the core technologies required to build impactful AI solutions, including hardware, data management, and advanced AI agents./nYou can get check out our programming, speakers, and more below — but for a limited time, we’re offering a discount to enable even more members of the AI community to participate in our event. Head here for the latest pricing that brings admission to just $292, plus an additional 50% off a second ticket. Act swiftly before this opportunity concludes!/nAbsorb invaluable insights from AI trailblazers on the main stage. We’ll explore every facet of AI, leaving you inspired and equipped to take your next big step in the field./nJoin breakout sessions to learn from the best minds in AI. Get your questions answered and take part in interactive, in-depth discussions./nConnect with startup founders, tech enthusiasts, and VC leaders, all gathered to explore the future of AI./nCheck back in for more speaker updates./nGet to know the rest of our speakers./nWe will reach out to you if your topic is selected./nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. If you’re interested in learning more about how your company can be part of the event, get in touch with our sales team below./nGain valuable experience assisting the TechCrunch Events Team. All volunteers receive a free event ticket to enjoy TC Sessions: AI before or after their shift./nGet your ticket at the lowest rate before time runs out. Or buy one ticket and get the second at 50% off. Groups get even more discounts./nMore than 1,200+ AI leaders, VCs, and innovators will meeting June 5 in Berkeley for an immersive experience with speakers from OpenAI, Anthropic, Cohere and more. Explore the AI ecosystem through main stage sessions, breakouts, and live demos of the latest AI innovations./nREGISTER NOW/nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more./n© 2024 Yahoo.",
      "Source Url": "https://techcrunch.com/events/tc-sessions-ai/"
   },
   {
      "id": 19,
      "Title": "TechCrunch + VivaTech: Innovation of the Year award",
      "author": "No Author",
      "Publish Date": " ",
      "Summary": "TechCrunch is joining forces with VivaTech, Europe’s biggest startup and tech event, to select startups for the prestigious VivaTech Innovation of the Year in Paris, France on June 11-12, 2025. The finalists will have the opportunity to pitch on stage, at VivaTech, and the winner will secure a place in the highly competitive Start Up Battlefield 200, with potential eligibility to present at TechCrunch’s flagship annual event, Disrupt, held in San Francisco, CA in October 2025.",
      "Full Content": "TechCrunch is joining forces with VivaTech, Europe’s biggest startup and tech event, to select startups for the prestigious VivaTech Innovation of the Year in Paris, France on June 11-12, 2025. The finalists will have the opportunity to pitch on stage, at VivaTech, and the winner will secure a place in the highly competitive Start Up Battlefield 200, with potential eligibility to present at TechCrunch’s flagship annual event, Disrupt, held in San Francisco, CA in October 2025./nThe VivaTech Innovation of the Year acknowledges and celebrates exhibiting startups at VivaTech 2025 that showcase outstanding innovation, advanced technological capabilities, and significant potential to revolutionize their respective industry./nTechCrunch will curate a shortlist of the top 30 candidates, appoint a jury member to help select the final top 5, and participate on stage at VivaTech on June 11 alongside the full jury during the final award presentation./nFive finalists will receive a valuable opportunity to pitch on the VivaTech stage on June 11, gain introductions to venture capitalists, enjoy exclusive networking with jury members, achieve high visibility across VivaTech marketing channels, and receive two additional 4-day passes to attend VivaTech 2025./nOn June 12, TechCrunch will also serve as the official host of the VivaTech Global Awards Ceremony, where the winners of the 5 VivaTech Awards will be announced, providing the Master of Ceremony to lead the event with introductions, award transitions, and the closing moment./nThe VivaTech Innovation of the Year winner will also secure a place in the highly competitive Start Up Battlefield 200, with potential eligibility to present at TechCrunch’s flagship annual event, Disrupt, held in San Francisco, CA in October 2025./n/nAbout Viva Technology/nVivaTech accelerates innovation by connecting startups, tech leaders, major companies and investors responding to our world’s biggest challenges./nEach year, over four exciting days in Paris, VivaTech creates Europe’s biggest technology and startup event, exploring the most disruptive topics in tech with world-premiere demos, launches and conferences in a collaborative ecosystem. This is where business meets innovation. Take part to the ninth edition of VivaTech 11-14 June 2025./nMore than 1,200+ AI leaders, VCs, and innovators will meeting June 5 in Berkeley for an immersive experience with speakers from OpenAI, Anthropic, Cohere and more. Explore the AI ecosystem through main stage sessions, breakouts, and live demos of the latest AI innovations./nREGISTER NOW/nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more./n© 2024 Yahoo.",
      "Source Url": "https://techcrunch.com/events/techcrunch-vivatech-innovation-of-the-year-award/"
   },
   {
      "id": 20,
      "Title": "StrictlyVC Menlo Park",
      "author": "No Author",
      "Publish Date": " ",
      "Summary": "StrictlyVC events deliver exclusive insider VC content while fostering meaningful connections among top investors and entrepreneurs. Join us for an evening of intimate interviews and impactful conversations with industry heavy hitters—brought to you in partnership with Mayfield, a venture capital firm with a 55-year legacy of partnering with founders from day zero and supporting them with unwavering commitment and founder-to-founder expertise.",
      "Full Content": "Mix and mingle — cocktail parties with killer content/nStrictlyVC events deliver exclusive insider content from Silicon Valley and the global venture scene. If you’re an investor looking to mingle with your peers and watch some killer content, this event is for you. Get the inside scoop directly from sources you can trust. Previous events included interviews with Sam Altman (Open AI), Marc Andreessen (Andreessen Horowitz), Katie Haun (Haun Ventures), Hans Tung (GGV Capital), and many more!/nMore speakers will be added. Check back in for updates!/nThis ticket is non-refundable/nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. If you’re interested in learning more about how your company can be part of the event, get in touch with our sales team below./nMore than 1,200+ AI leaders, VCs, and innovators will meeting June 5 in Berkeley for an immersive experience with speakers from OpenAI, Anthropic, Cohere and more. Explore the AI ecosystem through main stage sessions, breakouts, and live demos of the latest AI innovations./nREGISTER NOW/nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more./n© 2024 Yahoo.",
      "Source Url": "https://techcrunch.com/events/strictlyvc-menlo-park/"
   },
   {
      "id": 21,
      "Title": "TechCrunch All Stage 2025",
      "author": "No Author",
      "Publish Date": " ",
      "Summary": "TechCrunch is returning to Boston, MA with All Stage (formerly Early Stage), to bring you a full day of how-to, must-have founder knowledge, powered by Fidelity Investments.",
      "Full Content": "Wondering how to nail that pitch meeting and raise VC funding? Or how to build a high-octane sales team? What about recruiting early team members who will fuel future growth? Managing the finances of a new company while also wondering about your own personal finances as a founder? Legal? Marketing? PR? Being a great leader?/nFidelity is powering TechCrunch All Stage to answer every one of these questions. Sign up for event updates to be in the know when the agenda drops./nHear from accomplished startup leaders in panel-led breakout sessions as they reveal the secrets to their success. These main-stage sessions offer unparalleled access to the journeys, insights, and tips that can help take your startup to the next level./nParticipate in immersive sessions where startup pioneers and peers come together to discuss challenges, share stories, and build connections that drive success./nExpand your network, connect with founders, share insights, and form valuable relationships that inspire growth through networking opportunities./nMore speakers to come. Check back in to see agenda updates./nGet to know the rest of our speakers./nInterested in Speaking?/nApply for TechCrunch Audience Choice speaker nomination program.Application deadline is April 18./nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. If you’re interested in learning more about how your company can be part of the event, get in touch with our sales team below./nGain valuable experience assisting the TechCrunch Events Team. All volunteers receive a free event ticket to enjoy TechCrunch All Stage before or after their shift./nChoose your ticket and dive into actionable strategies every founder needs./nMore than 1,200+ AI leaders, VCs, and innovators will meeting June 5 in Berkeley for an immersive experience with speakers from OpenAI, Anthropic, Cohere and more. Explore the AI ecosystem through main stage sessions, breakouts, and live demos of the latest AI innovations./nREGISTER NOW/nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more./n© 2024 Yahoo.",
      "Source Url": "https://techcrunch.com/events/techcrunch-all-stage-2025/"
   },
   {
      "id": 22,
      "Title": "TechCrunch Disrupt 2025",
      "author": "No Author",
      "Publish Date": " ",
      "Summary": "LAST WEEK FOR EARLY BIRD RATES. Click here to save up to $900 on your ticket.",
      "Full Content": "LAST WEEK FOR EARLY BIRD RATES. Click here to save up to $900 on your ticket./nLAST WEEK FOR EARLY BIRD RATES. Click here to save up to $900 on your ticket./nFrom idea to IPO, Disrupt 2025 will map out the path for startups to achieve their next major milestone./nLooking to meet founders, connect with investors, seek advice, or land your next big role? Disrupt is the must-attend event to make it all happen in person./nDisrupt is more than a startup launchpad — it’s a growth accelerator. Dive into sessions on scaling, sales, and leadership, and connect with the investors and tech experts who can help take your business to the next level./nTap into the wisdom of founders and tech titans at Disrupt. From actionable tips to hard-won lessons, they’ll share what works (and what doesn’t) to guide you as you build your own path forward./nFind the ticket that fits you with up to a $900 discount until May 25. Groups can save up to 30%./nView all/nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more./nMore than 1,200+ AI leaders, VCs, and innovators will meeting June 5 in Berkeley for an immersive experience with speakers from OpenAI, Anthropic, Cohere and more. Explore the AI ecosystem through main stage sessions, breakouts, and live demos of the latest AI innovations./nREGISTER NOW/nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more./n© 2024 Yahoo.",
      "Source Url": "https://techcrunch.com/events/tc-disrupt-2025/"
   },
   {
      "id": 23,
      "Title": "Microsoft’s Satya Nadella is choosing chatbots over podcasts",
      "author": "Anthony Ha",
      "Publish Date": "15 hours ago",
      "Summary": "While Microsoft CEO Satya Nadella says he likes podcasts, he might not actually be listening to them anymore.",
      "Full Content": "Posted:/nWhile Microsoft CEO Satya Nadella says he likes podcasts, he might not actually be listening to them anymore./nThat tidbit comes towards the end of a longer Bloomberg profile of Nadella, with a focus on Microsoft’s AI strategy and its complicated relationship with OpenAI. To illustrate how much he uses the company’s Copilot AI assistant in his daily life, Nadella said that instead of listening to podcasts, he now uploads the transcripts to Copilot, then talks to Copilot about the content during his drive to the office./nIn addition, Nadella — who jokingly described his job as “email typist” — said he relies on at least 10 custom agents developed in Copilot Studio to summarize emails and messages, prepare for meetings, and perform other tasks around the office./nAI already seems to be transforming Microsoft in more substantial ways, with programers reportedly the hardest hit in the company’s recent layoffs, shortly after Nadella declared that 30% of the company’s code was written by AI./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/17/microsofts-satya-nadella-is-choosing-chatbots-over-podcasts/"
   },
   {
      "id": 24,
      "Title": "US man who hacked SEC’s X account to spike Bitcoin price sentenced to prison",
      "author": "Lorenzo Franceschi-Bicchierai",
      "Publish Date": "2 days ago",
      "Summary": "Eric Council Jr., 26, was sentenced to 14 months in prison and three years of supervised release on Friday for participating in the hack of the official X account of the U.S. Securities and Exchange Commission.",
      "Full Content": "Posted:/nEric Council Jr., 26, was sentenced to 14 months in prison and three years of supervised release on Friday for participating in the hack of the official X account of the U.S. Securities and Exchange Commission./nThe U.S. Department of Justice announced the sentencing in a press release. Council and other hackers took over the SEC’s X account in 2024 to falsely announce that the agency had approved Bitcoin exchange traded funds, or ETFs, which shot up the price of the cryptocurrency before later dropping./nAccording to the DOJ, Council and his co-conspirators performed a SIM swap attack against the cellphone account of a person who had access to the SEC’s X account, which allowed the hackers to take control of their phone number. From there, the hackers reset the password of the SEC’s X account, granting them control of the account./n/nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/16/us-man-who-hacked-secs-x-account-to-spike-bitcoin-price-sentenced-to-prison/"
   },
   {
      "id": 25,
      "Title": "Programmers bore the brunt of Microsoft’s layoffs in its home state as AI writes up to 30% of its code",
      "author": "Charles Rollet",
      "Publish Date": "3 days ago",
      "Summary": "Coders were hit hardest among Microsoft’s 2,000-person layoff in its home state of Washington, Bloomberg reports.",
      "Full Content": "Posted:/nCoders were hit hardest among Microsoft’s 2,000-person layoff in its home state of Washington, Bloomberg reports./nOver 40% of the people laid off were in software engineering, making it by far the largest category, Bloomberg found based on state filings. Relatively few sales or marketing positions were affected, Bloomberg added./nTo be fair, coders are a big chunk of Microsoft’s workforce, although it doesn’t disclose the exact proportion. The cuts are part of recent layoffs at Microsoft affecting about 6,000 people./nStill, these cuts come after CEO Satya Nadella said last month that up to 30% of the company’s code was now written by AI./nTechCrunch asked Microsoft if the layoffs were motivated by the rise of AI-assisted coding. The tech giant declined to comment. Microsoft has said the layoffs are aimed at reducing management layers./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/15/programmers-bore-the-brunt-of-microsofts-layoffs-in-its-home-state-as-ai-writes-up-to-30-of-its-code/"
   },
   {
      "id": 26,
      "Title": "Harvey reportedly in discussions to raise $250M at $5B valuation",
      "author": "Ram Iyer\nIvan Mehta",
      "Publish Date": "3 days ago",
      "Summary": "Legal tech startup Harvey is in discussions to raise more than $250 million in a funding round led by Kleiner Perkins and Coatue that would value it at $5 billion, Reuters reported, citing anonymous sources.",
      "Full Content": "Posted:/nLegal tech startup Harvey is in discussions to raise more than $250 million in a funding round led by Kleiner Perkins and Coatue that would value it at $5 billion, Reuters reported, citing anonymous sources./nSequoia Capital, which led the startup’s $300 million Series D just three months ago, is also expected to invest in this new round, Reuters reported, adding that investors are mostly drawn to the startup’s quick traction in the market./nHarvey has enjoyed fast growth as lawyers and legal firms around the world find ways to use generative AI tech to simplify research and documentation and to quickly examine their data. The company recorded annualized run-rate revenue of $75 million in April, Reuters reported./nThe news comes just a couple days after Harvey said it would start using AI models from Anthropic and Google, adding to the models it uses from its backer, OpenAI./nThe report did not mention if the Open AI Startup Fund, which backed Harvey early in its life, would also invest in this round./nCoatue, Sequoia, and Kleiner Perkins did not immediately return requests for comment. Harvey declined to comment./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/15/harvey-reportedly-in-discussions-to-raise-250m-at-5b-valuation/"
   },
   {
      "id": 27,
      "Title": "Radiologists aren’t going anywhere",
      "author": "Connie Loizos",
      "Publish Date": "4 days ago",
      "Summary": "Nine years ago, AI pioneer Geoffrey Hinton sent shock waves through medicine by declaring it “just completely obvious” that AI would make radiologists extinct in short order. Fast-forward and the specialists — who do more than analyze images — are thriving, observes The New York Times. In fact, the field is experiencing explosive growth amid a looming workforce crisis. (According to projections from the Association of American Medical Colleges, the U.S. will face a staggering shortage of up to 42,000 radiologists and other physician specialists by 2033.)",
      "Full Content": "Posted:/nNine years ago, AI pioneer Geoffrey Hinton sent shock waves through medicine by declaring it “just completely obvious” that AI would make radiologists extinct in short order. Fast-forward and the specialists — who do more than analyze images — are thriving, observes The New York Times. In fact, the field is experiencing explosive growth amid a looming workforce crisis. (According to projections from the Association of American Medical Colleges, the U.S. will face a staggering shortage of up to 42,000 radiologists and other physician specialists by 2033.)/nRather than stealing jobs, notes the piece, AI has become radiologists’ secret weapon, allowing them to instantly measure organs, automatically flag abnormalities, and even detect diseases years before conventional methods. At the Mayo Clinic, where radiologist numbers have skyrocketed by 55% since Hinton’s prediction, the radiology department has grown to include a 40-person team of AI scientists, researchers, analysts, and engineers who have licensed and developed more than 250 AI models, ranging from tissue analyzers to disease predictors./n“Five years from now, it will be malpractice not to use AI,” says John Halamka, president of the Mayo Clinic Platform, who oversees the health system’s digital initiatives, in the article./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/14/radiologists-arent-going-anywhere/"
   },
   {
      "id": 28,
      "Title": "SoundCloud backtracks on AI-related terms-of-use updates",
      "author": "Kyle Wiggers",
      "Publish Date": "4 days ago",
      "Summary": "SoundCloud says it’s revising its terms after widespread backlash over a clause related to AI model training.",
      "Full Content": "Posted:/nSoundCloud says it’s revising its terms after widespread backlash over a clause related to AI model training./nEarlier this year, SoundCloud quietly updated its usage policies, adding wording that many users interpreted as legal cover to allow the company to train AI on audio uploaded to its platform. SoundCloud was quick to assert that it wasn’t developing AI by using its users’ content, but the company’s PR statement didn’t allay fears that SoundCloud might do so in the future./nOn Wednesday, SoundCloud CEO Eliah Seton published an open letter admitting that the wording of the changes to the company’s terms “was too broad and wasn’t clear enough.” The updates were intended to focus on other uses of AI internally at the company, Seton said — including recommendations and tools to help prevent fraud — but missed the mark./nSoundCloud has now revised its terms “to make it absolutely clear [that] SoundCloud will not use [user] content to train generative AI models that aim to replicate or synthesize [a] voice, music, or likeness,” said Seton./nTopics/n© 2025 TechCrunch Media LLC.",
      "Source Url": "https://techcrunch.com/2025/05/14/soundcloud-backtracks-on-ai-related-terms-of-use-updates/"
   }
]